CodenameNightwing/WebServices/WS especificos/Sabre/XMLSabreRQ/AddRemarkLLSRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns="http://webservices.sabre.com/sabreXML/2011/10">
   <soapenv:Header>
      <sec:Security>
        <sec:BinarySecurityToken valueType="?" EncodingType="?">?</sec:BinarySecurityToken>
      </sec:Security>
      <mes:MessageHeader mes:id="?" mes:version="?">
         <mes:From>
            <!--1 or more repetitions:-->
            <mes:PartyId mes:type="?">?</mes:PartyId>
            <!--Optional:-->
            <mes:Role>?</mes:Role>
         </mes:From>
         <mes:To>
            <!--1 or more repetitions:-->
            <mes:PartyId mes:type="?">?</mes:PartyId>
            <!--Optional:-->
            <mes:Role>?</mes:Role>
         </mes:To>
         <mes:CPAId>AR</mes:CPAId>
         <mes:ConversationId>TestSuitARIT</mes:ConversationId>
         <mes:Service mes:type="?">AddRemarkLLSRQ</mes:Service>
         <mes:Action>AddRemarkLLSRQ</mes:Action>
         <mes:MessageData>
            <mes:MessageId>?</mes:MessageId>
            <mes:Timestamp>?</mes:Timestamp>
            <!--Optional:-->
            <mes:RefToMessageId>?</mes:RefToMessageId>
            <!--Optional:-->
            <mes:TimeToLive>?</mes:TimeToLive>
            <!--Optional:-->
            <mes:Timeout>5</mes:Timeout>
         </mes:MessageData>
         <!--Optional:-->
         <mes:DuplicateElimination>?</mes:DuplicateElimination>
         <!--Zero or more repetitions:-->
         <mes:Description xml:lang="?">?</mes:Description>
         <!--You may enter ANY elements at this point-->
      </mes:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ns:AddRemarkRQ ReturnHostCommand="true" Version="2.1.1">
         <ns:RemarkInfo>
            <!--Optional:-->
            <ns:FOP_Remark Type="TBM">
               <!--Optional:-->
               <ns:CC_Info Suppress="false">
                  <ns:PaymentCard Code="?" ExpireDate="?" Number="?"/>
               </ns:CC_Info>
            </ns:FOP_Remark>
         </ns:RemarkInfo>
      </ns:AddRemarkRQ>
   </soapenv:Body>
</soapenv:Envelope>